<!DOCTYPE html>
<html>
<head>
    <!--- Hello --->
<title> Kolmas tund </title>
<link rel="stylesheet" type="text/css" href="tund3.css">
<script type="text/javascript" src="post.js"></script>
<script src="https://ajax.googleapis.com/ajax/libs/jquery/3.1.1/jquery.min.js"></script>
</head>
<body>
<h1> Kolmas tund </h1>
    <br>
    <h2> Selles tunnis õpime</h2>
    <ul>
    <li>Kuidas kasutada internetti turvaliselt</li>
        <li>Kuidas kasutada erinevaid otsingumootoreid</li>
        <li>Mis on Wikipedia ja kuidas seda kasutada</li>
        <li> Kordame klaviatuuri kasutamist</li>
    </ul>
    <br>
    <hr>
    <h2> Kuidas kasutada internetti turvaliselt</h2>
    <div id="digitark">
        <p class="lead" style="box-sizing: inherit; margin: 0px; font-size: 1.33em; line-height: 1.3; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; text-align: justify;">Internetiavarused on t&auml;is pahatahtlikke programme, viiruseid ja petuskeeme, mis v&otilde;ivad pahaaimamatu internetikasutaja kerge&nbsp;vaevaga konksu otsa t&otilde;mmata.&nbsp;Selleks, et internetti turvalisemalt kasutada, tasub meeles pidada m&otilde;ningaid n&auml;pun&auml;iteid.</p>
<h2>
	P&Otilde;HIT&Otilde;ED</h2>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;"><span style="box-sizing: inherit; font-weight: 700;">Kui kahtled, siis kustuta &auml;ra</span></p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Pahavara ning erinevad skeemid andmete varastamiseks muutuvad j&auml;rjest targemaks ning kui e-postile saabub kahtlane kiri, mille p&auml;ritolu sa ei tea, siis targem on kirja mitte avada ja see otse pr&uuml;gikasti saata. Kui siiski oled kahtlase meili avanud, siis kindlasti tuleks&nbsp;v&auml;ltida kaasas olevate manuste v&otilde;i linkide avamist.</p>	<p style="box-sizing: inherit; margin: 0px; display: inline; text-align: justify;">Kui meil suunab sind mingile&nbsp;kodulehele, kus sul konto on olemas, siis pigem kasuta lehele liikumiseks aadressiriba ning logi sinna sisse oma paroolidega.</p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;"><span style="box-sizing: inherit; font-weight: 700;">Tee regulaarselt tarkvarauuendusi</span></p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">L&uuml;lita sisse automaatne tarkvarav&auml;rskendamine nii oma telefonis, tahvelarvutis kui ka s&uuml;le- ja lauaarvutis. See tagab, et k&otilde;ik v&auml;rskeimad turvav&auml;rskendused on sinu seadmes alati olemas.</p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;"><span style="box-sizing: inherit; font-weight: 700;">M&otilde;tle enne, kui tegutsed</span></p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Internetis surfates ole eriti t&auml;helepanelik pakkumiste suhtes, mis n&otilde;uavad kohest tegutsemist, k&uuml;sivad personaalseid isikuandmeid v&otilde;i on lihtsalt liiga head, et olla t&otilde;si.</p>Tasuta l&otilde;unaid ei ole olemas.</p>
<h2>
	PRIVAATSUSS&Auml;TTED</h2>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Endast liigse informatsiooni jagamine sotsiaalv&otilde;rgustikes nagu Facebook ja Google on oht, mis v&otilde;ib kahjustada nii sinu mainet kui ka isiklikku vara. Kui oled harjunud k&otilde;ike jagama &ndash;&nbsp;kohti,&nbsp;kus oled k&auml;inud v&otilde;i oled praegu, millist marsruuti pidi &otilde;htuti jooksed, ning see k&otilde;ik on lisaks sinu s&otilde;pradele n&auml;htav ka inimestele, keda sa ei tunne, siis on oht, et seda infot kasutavad &auml;ra inimesed, kes su maja sinu Egiptuse-reisi ajal t&uuml;hjaks teevad.</p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Samuti v&otilde;ivad sinu enda v&otilde;i sinu s&otilde;prade poolt ajajoonele lisatud&nbsp;pildid m&otilde;nest rajust peost m&otilde;juda negatiivselt olemasolevale v&otilde;i potentsiaalsele t&ouml;&ouml;andjale. Ebameeldivate olukordade v&auml;ltimiseks vaata &uuml;le oma privaatsuss&auml;tted nii Facebookis, Google&rsquo;is kui ka teistes v&otilde;rgustikes, millega oled liitunud.&nbsp;Privaatsuss&auml;tete muutmiseks on tavaliselt lisatud valik seadete men&uuml;&uuml;sse.</p>
<h2>
	&ldquo;K&Uuml;PSISTE&rdquo; BLOKEERIMINE</h2>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">&ldquo;K&uuml;psisteks&rdquo; kutsutakse andmeid, mida veebilehe k&uuml;lastamisel sinu arvutisse salvestatakse. See v&otilde;ib sisaldada infot, millal viimati sellel veebilehel k&auml;isid, mis on sinu kasutajanimi ning teadmist, kas sind peaks automaatselt sisse logima.</p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Kuigi see v&otilde;ib olla mugav, et ei pea alatasa oma kasutajanime ja parooli veebilehele sisestama, v&otilde;ib see siiski olla kahjulik, kui sinu arvutit kasutavad ka teised inimesed.&nbsp;&ldquo;K&uuml;psiste&rdquo; blokeerimiseks v&otilde;id kasutada n&auml;iteks&nbsp;<a href="https://adblockplus.org/" style="box-sizing: inherit; background-color: transparent; text-decoration: none; color: rgb(153, 10, 227);">AdBlock Plus&rsquo;</a>i v&otilde;i&nbsp;<a href="https://www.ublock.org/" style="box-sizing: inherit; background-color: transparent; text-decoration: none; color: rgb(153, 10, 227);">uBlock&rsquo;i</a>.</p>
<h2>
	&Auml;RA HOIA K&Otilde;IKI MUNE &Uuml;HES KORVIS</h2>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Paljud veebilehed pakuvad uue konto registreerimiseks v&otilde;imalust &uuml;hendamiseks&nbsp;sinu Facebooki v&otilde;i Google&rsquo;i kontoga. See t&auml;hendab, et sisselogimiseks saad&nbsp;kasutada&nbsp;samu paroole v&otilde;i kui juba oled &uuml;hte keskkonda sisse loginud, logitakse automaatselt sind sisse ka teise.</p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Taas &ndash; mugav lahendus, mis v&auml;hendab tr&uuml;kkimise vaeva, kuid juhul, kui peaksid kaotama kontrolli oma Facebooki konto &uuml;le, kaotad kontrolli ka k&otilde;ikide teiste keskkondade &uuml;le, mis sellega &uuml;hendatud on.</p>
<h2>
	AVALIKUD WIFID, TULEM&Uuml;&Uuml;RID JA VIIRUSET&Otilde;RJED</h2>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;"><span style="box-sizing: inherit; font-weight: 700;">Avalikud wifi-v&otilde;rgud</span></p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Kasuta v&otilde;imalikult v&auml;he avalikke wifi-levialasid (ilma paroolita wifi-d), kuna nende kaudu v&otilde;idakse sinu nutiseadmesse &uuml;sna lihtsa vaevaga sisse murda. Kui su kodusel wifil ei ole veel tugevat parooli, siis viimane aeg on see sinna lisada. See suurendab sinu privaatsust ning hoiab &auml;ra n-&ouml; wifi-vargad, kes sinu makstavat internetti k&otilde;rvalkorterist tasuta kasutavad.</p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;"><span style="box-sizing: inherit; font-weight: 700;">Tulem&uuml;&uuml;rid</span></p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Kasuta tulem&uuml;&uuml;re, mis hoiavad &auml;ra tahtmatu internetiliikluse sinu seadmes. Tavaliselt on need juba operatsioonis&uuml;steemi sisse ehitatud, kuid vahel l&uuml;litavad kasutajad neid ise ka v&auml;lja. Vaata &uuml;le seadistused operatsioonis&uuml;steemides&nbsp;<a href="http://windows.microsoft.com/et-ee/windows-8/windows-firewall-from-start-to-finish" style="box-sizing: inherit; background-color: transparent; text-decoration: none; color: rgb(153, 10, 227);">Windows 10</a>&nbsp;ja&nbsp;<a href="https://support.apple.com/en-us/HT201642" style="box-sizing: inherit; background-color: transparent; text-decoration: none; color: rgb(153, 10, 227);">Mac OS X</a>.</p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;"><span style="box-sizing: inherit; font-weight: 700;">Viiruset&otilde;rjed</span></p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Lisaks olemasolevale tulem&uuml;&uuml;rile on alati hea idee kasutada ka viiruset&otilde;rjeprogramme. Neid on saadaval nii tasuta versioone (<a href="http://free.avg.com/eu-en/homepage" style="box-sizing: inherit; background-color: transparent; text-decoration: none; color: rgb(153, 10, 227);">AVG Free</a>) kui ka tasulisi (<a href="https://www.telekom.ee/era/internet/kodus/arvutikaitse/" style="box-sizing: inherit; background-color: transparent; text-decoration: none; color: rgb(153, 10, 227);">Elioni&nbsp;Arvutikaitse</a>).</p>
	<p style="box-sizing: inherit; margin: 0px; display: inline; text-align: justify;">Tasulistele versioonidele tulevad uute viiruste t&otilde;rjeks loodavad uuendused kiiremini ning neis ei kuvata reklaame tasulise versiooni soetamiseks.</p>
<h2>
	TUGEVAMAD PAROOLID</h2>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Paroolide loomisel tuleks v&auml;ltida loogiliselt ennustatavaid paroole nagu eesperekonnanimi123 v&otilde;i 0000&nbsp;ning m&otilde;elda tuleks parool, mida pahalane &auml;ra ei arva. M&otilde;tle v&auml;lja suvaline s&otilde;na (n&auml;tieks s&uuml;gistuul), asenda osa t&auml;hti numbritega ja t&auml;pit&auml;hed v&otilde;&otilde;rt&auml;htedega&nbsp;(syg1stuul) ning&nbsp;lisa parooli m&otilde;ni suurt&auml;ht&nbsp;(syg1Stuul).</p>
	<p style="box-sizing: inherit; margin: 0px; display: inline; text-align: justify;">Kuna telefonide ekraanil olev mustus j&auml;tab tihti sinu joonistatud mustri ekraanile n&auml;htavaks.</p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Sama lugu kehtib nutiseadmete ekraanilukkudega. Ekraanile joonistatavad mustrid on alati v&auml;hem turvalised kui pin-koodid v&otilde;i s&otilde;nalised paroolid, kuna telefonide ekraanil olev mustus j&auml;tab tihti sinu joonistatud mustri ekraanile n&auml;htavaks. Kui siiski paned oma ekraanilukuks mustri, v&otilde;ta seadetest maha n&auml;htav muster, et n&auml;puga mustrit joonistades ei tekiks ekraanile rohelist&nbsp;joont, mis kinnitab mustri &otilde;igsust.&nbsp;V&auml;ldi samade paroolide kasutamist mitmes kohas, kuna &uuml;he parooli kaotamisega kaotaksid sellisel juhul kontrolli mitme keskkonna &uuml;le.</p>
<h2>
	SURFA TEADLIKULT</h2>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Aeg-ajalt kustuta oma internetiajalugu (Chrome&rsquo;i kasutades saab seda teha lehe &uuml;lemises paremas nurgas asuva men&uuml;&uuml; kaudu). Kui sa ei kasuta enam oma Facebooki v&otilde;i Google&rsquo;i postkasti, siis logi neist v&auml;lja ning &auml;ra hoia neid brauseri vahelehtedel avatuna. Kui &uuml;laltoodu ei ole sinu privaatsuse kaitsmiseks siiski piisav, v&otilde;id internetis k&auml;imiseks kasutada ka spetsiaalset brauserit&nbsp;<a href="https://www.torproject.org/" style="box-sizing: inherit; background-color: transparent; text-decoration: none; color: rgb(153, 10, 227);">Tor</a>, mis ei avalikusta sinu asukohta ega lehitsemisharjumusi.</p>
<p style="box-sizing: inherit; margin: 1em 0px 0px; color: rgb(0, 0, 0); font-family: &quot;Neue Helvetica W01&quot;, sans-serif; font-size: 14px; text-align: justify;">Ettev&otilde;tted nagu Google koguvad sinu andmeid (sugu, vanus, asukoht jms), et kuvatavad reklaamid oleksid v&otilde;imalikult personaalsed. Sama kehtib paljude teiste veebikeskkondade kohta ning kuigi me tavaliselt ei loe registreerumisel n&auml;idatavat&nbsp;privaatsuseeskirja, siis kahju see kindlasti ei teeks, kui teaksime, milliseid andmeid meie kohta kogutakse ning kellega neid jagatakse.</p>
        <p>Allikas = www.digitark.ee/kuidas-turvaliselt-internetti-kasutada/</p>
</div>
    <br>
    <hr>
    <h2>Otsingu Mootorid</h2>
    <div id="google">
    <h3>Google</h3>
        <img src="images/googlelogo.png" height="200" width="300">
    <p>Google Inc. on paljurahvuseline tehnoloogia- ja tarkvaraettev&otilde;te, mille asutasid 7. novembril 1998 Stanfordi &uuml;likooli doktorandid Larry Page ja Sergei Brin. 2015. aastast on Google&#39;i omanikuks Alphabet Inc. Google Search on selle ettev&otilde;tte arendatav maailma populaarseim interneti otsingumootor, Google&#39;i esimene ja t&auml;htsaim toode.</p>
<p>Google'i otsingumootor on kõige populaarsem otsingumootor hea põhjusega - nimelt on see kõige võimsam ning kõige turvalisem neist.</p>
 <p>Iga kord kui teil tekib m&otilde;ni k&uuml;simus &uuml;ks k&otilde;ik mis teema kohta, on peaaegu alati v&otilde;imalik leida vastus l&auml;bi Google&#39;i. Google otsib l&auml;bi k&otilde;ik l&auml;bik&auml;idavad veebilehed ning leiab k&otilde;ik otsingu fraasile vastavad lehed populaarsuse j&auml;rjekorras.</p>
<p>Just selle p&auml;rast on Google &uuml;ks k&otilde;ige olulisemaid veebilehti mida &otilde;ppida kasutama. &Uuml;tleme, et teil on k&uuml;simus kuidas istuda toolis arvuti taga. Selle asemel, et hakata otsima seda informatsiooni kusagilt raamatust v&otilde;i kelleltki f&uuml;&uuml;siliselt k&uuml;sida v&otilde;ib seda teha palju kiiremine Google&#39;i abil.&nbsp;</p>
<ol>
<li>Minge lehele www.google.com <a href="https://www.google.ee/" target="_blank">Või vajutage siia lingi peale!</a></li>
<li>Kirjuta oma soovitud otsingu fraas teksti kasti - sel juhul otsige &quot;kuidas arvutitoolil istuda&quot;</li>
    <img src="images/google.PNG">
<li>Vajuta hiirega &quot;Google Search/Google Otsing&quot; nupu peale v&otilde;i vajutage klaviaaturil klahvi enter.</li>
</ol>
<p>See sooritab otsingu ja siis te n&auml;ete oma otsingu tulemusi. Avaneb leht teie tulemustega kus te saate soovil filtreerida oma otsinguid, n&auml;iteks saate otsida ainult pilte, videosid, kaarte vms.</p>
<br>
    <img src="images/google2.PNG">
<p>Nii moodi saate te leida vastuseid &uuml;ks k&otilde;ik mis k&uuml;simustele, ulatudes arvuti probleemidest kuni n&auml;iteks retseptide v&otilde;i aadresside otsimiseni. &Uuml;ks k&otilde;ik mis teile p&auml;he tuleb, Google&#39;il on sellele vastus.</p>
    </div>
    <br>
    <hr>
    <br>
    <div id="wiki">
    <h2>Wikipedia</h2>
        <img src="images/wikipedia" height="200" width="300">
        <br>
        <p><a href="https://et.wikipedia.org/wiki/Esileht" target="_blank">Wikipedia</a> on interneti tasuta entsüklopeedia, mis hõlmab lugematuid erinevaid teemasid. Seal saab uurida täpsemalt paljude teemade kohta täpsemalt. Wikipedia't on võimalik lugeda eesti keeles ning kogu selle sisu on kirjutatud vabatahtlikude inimeste poolt ning üle kontrollitud. Kuigi kogu informatsioon on vabatahtlikult ja anonüümselt lisatud on sisu kontroll väga täpne ning seega on see peaaegu alati tõsi. Wikipedias on võimalik lugeda erinevate teemade kohta usaldusväärset infomatsiooni, olenemata mis teema teid sel hetkel huvitab.</p>
        <ol>
        <li> Minge lehele et.wikipedia.org</li>
        <li> Vajutage üleval paremal asetsevale tektsiväljale mille peal on kirjas "Otsi vikipeediast" vasaku klahviga </li>
         <li>Kirjutage sõna "arvuti" ning vajutage klaviatuuril klahvile "Enter" </li>
        </ol>
        <p> Avaneb leht teemal "arvuti", mis räägib teemast võimalikult detailselt. Kui olete sellega veidi tutvunud, proovige otsida informatsiooni mõne teise teema kohta sama moodi.</p>
    </div>
    <br>
    <hr>
    <br>
    <div id="kliinik">
    <h2>Kliinik.ee</h2>
        <img src="images/kliinik.PNG">
    <p><a href="https://www.kliinik.ee/" target="_blank">Kliinik.ee</a> on veebileht, kus saab leida informatsiooni erinevate meditsiiniliste teemade kohta. Näiteks saab seal lugeda erinevate haiguste kohta ja sümptomitest mis nendega kaasnevad, seal saab uurida igasuguste ravimite kohta ja milles need seisnevad, leida nippe esmaabi jaoks ja nii edasi.</p>
    <p>Kliinik.ee ei asenda kindlasti arsti abi ning kunagi ei tohiks teha otsuseid vaid ise enda diagnoosi läbi, kuid see on kasulik keskkond et tutvuda täpsemalt haiguste kohta mis teid huvitab või näiteks et lugeda uute ravimite kohta mida teile on välja kirjutatud.</p>
    <p> Sama moodi kui Google ja Wikipedia töötab ka kliinik.ee</p>
    <p> Tuleb otsida fraasi läbi nende otsingumootori ning siis tulevad sellele fraasile vastavad vastused</p>
    <p>Otsige märksõna järgi "kurguvalu" ning avage sama nimeline artikkel</p>
    </div>
    <br>
    <hr>
    <br>
    <div id="youtube">
        <h2>Youtube</h2>
        <img src="images/youtube.png" height="200" width="300">
        <p><a href="https://www.youtube.com/" target="_blank">Youtube</a> on viimane otsingumootor millest me täna räägime</p>
        <p> Nagu Google Otsing on ka Youtube omatud Google'i poolt. Youtube on veebileht kus saab vaadata ja üles laadida video faile. Selle arhiivis on miljoneid erinevaid videosid, ulatudes treening videodest kuni muusika videodeni. Videosid tuleb sama moodi nagu teistel lehtedel lihtsalt otsingu mootori abil otsida. Et avada leitud videot tuleb vaid selle peale ühe korra vasaku klahviga vajutada, et see alustaks mängimise</p>
        <p>Otsige terminit "laptop ergonomics", avage esimene video mis selle nime alt tuleb ning vaadake seda.</p>
    </div>
    
    <br>
    <br>
    <br>
    <hr>
    <br>
    <h2> <a href="https://www.typingclub.com/" target="_blank">Kui olete kõik eelnevad lehed läbi vaatanud ning tunnete end mugavalt neid kasutades, vajutage siia et jätkata klaviatuuri harjutustega.</a></h2>
    <br>
    <!---
    <iframe src="https://www.typingclub.com/sportal/team-259/program-typing-jungle/play-fjkd-2.play"
    height="750px"
    width="1000px">
    </iframe>
--->
</html>